In [2]:
import numpy as np
import pandas as pd

In [3]:
data = {"grammer":["Python", "C", "Java", "GO", np.nan, "SQL", "PHP", "Python"],
        "score":[1,2,np.nan,4,5,6,7,10]}

In [4]:
df = pd.DataFrame(data)
df

  grammer  score
0  Python    1.0
1       C    2.0
2    Java    NaN
3      GO    4.0
4     NaN    5.0
5     SQL    6.0
6     PHP    7.0
7  Python   10.0

In [5]:
df[df['grammer'] == 'Python']

  grammer  score
0  Python    1.0
7  Python   10.0

In [6]:
results = df['grammer'].str.contains("Python")
results

0     True
1    False
2    False
3    False
4      NaN
5    False
6    False
7     True
Name: grammer, dtype: object

In [13]:
results.fillna(value=False, inplace = True) # inplace = True 表示修改原值， 否则只是临时值改变。
results

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7     True
Name: grammer, dtype: bool

In [14]:
df[results]

  grammer  score
0  Python    1.0
7  Python   10.0

In [15]:
df.columns

Index(['grammer', 'score'], dtype='object')

In [17]:
df.rename(columns={'grammer':'Grammer','score':'Score'})

  Grammer  Score
0  Python    1.0
1       C    2.0
2    Java    NaN
3      GO    4.0
4     NaN    5.0
5     SQL    6.0
6     PHP    7.0
7  Python   10.0

In [26]:
df.rename(columns={'Grammer':'grammer','Score':'popularity'})

  grammer  popularity
0  Python         1.0
1       C         2.0
2    Java         NaN
3      GO         4.0
4     NaN         5.0
5     SQL         6.0
6     PHP         7.0
7  Python        10.0

In [21]:
df['grammer'].value_counts()   # group by grammer

Python    2
SQL       1
Java      1
GO        1
C         1
PHP       1
Name: grammer, dtype: int64

In [28]:
df

  grammer  score
0  Python    1.0
1       C    2.0
2    Java    NaN
3      GO    4.0
4     NaN    5.0
5     SQL    6.0
6     PHP    7.0
7  Python   10.0

In [29]:
df['score'] = df['score'].fillna(df['score'].interpolate())  # 通过上/下记录的平均值 填充scores的nan值

In [30]:
df

  grammer  score
0  Python    1.0
1       C    2.0
2    Java    3.0
3      GO    4.0
4     NaN    5.0
5     SQL    6.0
6     PHP    7.0
7  Python   10.0

In [31]:
df[df['score'] > 3]  ## where score > 3

  grammer  score
3      GO    4.0
4     NaN    5.0
5     SQL    6.0
6     PHP    7.0
7  Python   10.0

In [32]:
df.drop_duplicates(['grammer'])  # grammer去重。。

  grammer  score
0  Python    1.0
1       C    2.0
2    Java    3.0
3      GO    4.0
4     NaN    5.0
5     SQL    6.0
6     PHP    7.0

In [33]:
df['score'].mean()  # avg(score)

4.75

In [34]:
df['grammer'].to_list()

['Python', 'C', 'Java', 'GO', nan, 'SQL', 'PHP', 'Python']

In [36]:
df.to_excel('test.xlsx')

In [37]:
df.shape

(8, 2)

In [39]:
df[(df['score']>3) & (df['score'] <8)] # where score >3 and score < 8

  grammer  score
3      GO    4.0
4     NaN    5.0
5     SQL    6.0
6     PHP    7.0

In [41]:
temp = df['score']
df.drop(labels='score', axis = 1, inplace = True) # 删除score 列
df.insert(0, 'score', temp)  # 在第０列位置插入新列ｔｅｍｐ
df

   score grammer
0    1.0  Python
1    2.0       C
2    3.0    Java
3    4.0      GO
4    5.0     NaN
5    6.0     SQL
6    7.0     PHP
7   10.0  Python

In [42]:
cols = df.columns[[1,0]]
cols

Index(['grammer', 'score'], dtype='object')

In [43]:
df = df[cols]
df

  grammer  score
0  Python    1.0
1       C    2.0
2    Java    3.0
3      GO    4.0
4     NaN    5.0
5     SQL    6.0
6     PHP    7.0
7  Python   10.0

In [50]:
df[df['score'] == df['score'].max()]  # select * from score = max(score)

  grammer  score
7  Python   10.0

In [51]:
df.tail(4)                 # 最后4行  where rownum <=4 order by id desc

  grammer  score
4     NaN    5.0
5     SQL    6.0
6     PHP    7.0
7  Python   10.0

In [53]:
df.drop([len(df) -1], inplace = True) #删除最后一行

In [54]:
df

  grammer  score
0  Python    1.0
1       C    2.0
2    Java    3.0
3      GO    4.0
4     NaN    5.0
5     SQL    6.0

In [55]:
row_data = {'grammer':'Perl', 'score':6.6}
df = df.append(row_data, ignore_index = True)
df

  grammer  score
0  Python    1.0
1       C    2.0
2    Java    3.0
3      GO    4.0
4     NaN    5.0
5     SQL    6.0
6    Perl    6.6

In [56]:
row_data = {'grammer':'Js', 'score':3.2}
df = df.append(row_data, ignore_index = True)
df

  grammer  score
0  Python    1.0
1       C    2.0
2    Java    3.0
3      GO    4.0
4     NaN    5.0
5     SQL    6.0
6    Perl    6.6
7      Js    3.2

In [57]:
df.sort_values('score', inplace = True)

In [58]:
df

  grammer  score
0  Python    1.0
1       C    2.0
2    Java    3.0
7      Js    3.2
3      GO    4.0
4     NaN    5.0
5     SQL    6.0
6    Perl    6.6

In [59]:
df['grammer'] = df['grammer'].fillna('R')
df['len_str'] = df['grammer'].map(lambda x: len(x))  # 统计grammer 字符长度
df

  grammer  score  len_str
0  Python    1.0        6
1       C    2.0        1
2    Java    3.0        4
7      Js    3.2        2
3      GO    4.0        2
4       R    5.0        1
5     SQL    6.0        3
6    Perl    6.6        4